In [1]:
import pandas as pd
import numpy as np
import mysql.connector as conn
from sqlalchemy import create_engine

In [2]:
db_conect=conn.connect(host='localhost', user='root', passwd='16082016$Noa', database='employees')

In [3]:
passw = '16082016$Noa'
str_conn='mysql+pymysql://root:'+passw+'@localhost:3306/db_practica'

motor=create_engine(str_conn)

In [4]:
cursor=db_conect.cursor()

In [5]:
cursor.execute('show tables;')

for x in cursor:
    print(x)

('current_dept_emp',)
('departments',)
('dept_emp',)
('dept_emp_latest_date',)
('dept_manager',)
('employees',)
('salaries',)
('titles',)

# Ejercicio 1.

    Obtener la cantidad de empleados por género de cada departamento.

In [6]:
gender_employees_per_department = pd.read_sql('''
    select distinct dept_name, 
    count(case employees.gender when 'M' then 1 end) as Male, 
    count(case employees.gender when 'F' then 1 end) as Female
    from employees
    join dept_emp on employees.emp_no = dept_emp.emp_no
    join departments on departments.dept_no = dept_emp.dept_no 

    group by departments.dept_name

    ;
    ''', con=db_conect)
gender_employees_per_department

            dept_name   Male  Female
0    Customer Service  14132    9448
1         Development  51449   34258
2             Finance  10331    7015
3     Human Resources  10711    7075
4           Marketing  12174    8037
5          Production  43936   29549
6  Quality Management  12039    8078
7            Research  12687    8439
8               Sales  31391   20854

# Ejercicio 2

    Obtén los nombres de los managers activos y el de su predecesor por cada
    departamento.

In [7]:
deparment_managers = pd.read_sql('''
Select Deparment, Manager, Previous_Manager from
	(select distinct departments.dept_name as Deparment, 
    concat(employees.first_name, ' ', employees.last_name)as Manager ,
    lag(concat(employees.first_name, ' ', employees.last_name), 1) 
    over (partition by departments.dept_name  order by dept_manager.to_date) as Previous_Manager,
    from_date as Starts_Contract,
    to_date as End_Contract
    from departments

    join dept_manager on departments.dept_no = dept_manager.dept_no
    join employees on dept_manager.emp_no = employees.emp_no) as Managers
where End_Contract = '9999-01-01'
;

    ''', con=db_conect)
deparment_managers

            Deparment            Manager       Previous_Manager
0    Customer Service    Yuchang Weedman       Xiaobin Spinelli
1         Development      Leon DasSarma      DeForest Hagimont
2             Finance   Isamu Legleitner             Ebru Alpin
3     Human Resources    Karsten Sigstam   Shirish Ossenbruggen
4           Marketing  Vishwani Minakawa   Margareta Markovitch
5          Production     Oscar Ghazalie            Shem Kieras
6  Quality Management         Dung Pesch         Sanjoy Quadeer
7            Research      Hilary Kambil           Arie Staelin
8               Sales        Hauke Zhang  Przemyslawa Kaelbling

# Ejercicio 3

    Obtén la cantidad de empleados que tiene cada manager.

In [9]:
employees_per_manager = pd.read_sql('''
    Select Department, 
    concat(employees.first_name, ' ', employees.last_name) as Manager,  
    Number_of_Employees
    from
    (select  departments.dept_name as Department, 
    count(distinct(employees.emp_no))-1 as Number_of_Employees
    from departments
    join dept_manager on departments.dept_no = dept_manager.dept_no
    join dept_emp on departments.dept_no = dept_emp.dept_no
    join employees on dept_emp.emp_no = employees.emp_no
    group by departments.dept_name) as Employees_per_department

    join departments on Employees_per_department.Department = departments.dept_name
    join dept_manager on departments.dept_no = dept_manager.dept_no
    join employees on dept_manager.emp_no = employees.emp_no

    where dept_manager.to_date = '9999-01-01'


    ;

    ''',  con=db_conect)
employees_per_manager

           Department            Manager  Number_of_Employees
0           Marketing  Vishwani Minakawa                20210
1             Finance   Isamu Legleitner                17345
2     Human Resources    Karsten Sigstam                17785
3          Production     Oscar Ghazalie                73484
4         Development      Leon DasSarma                85706
5  Quality Management         Dung Pesch                20116
6               Sales        Hauke Zhang                52244
7            Research      Hilary Kambil                21125
8    Customer Service    Yuchang Weedman                23579